<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"test-apply apply_apply_error","backend":"0c8e3943c87b290beaefdcfe0036cd9cf593ab09b37028c5469d8e20cace7816","plan_job_ref":"Job Test terraform-apply #714 at https://github.com/dflook/terraform-github-actions/actions/runs/14040972075","plan_out_hash":"70ce214e4c33be6ac70bd52a4d0e661c9cdd6de6bbe5d9550413619533e1d584","plan_hash":"4e5a89e49772c5cfc7dd470c06cef0aac36c3cfd7bf66b6b9fff0ba07c5c3787","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __test-apply apply_apply_error__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
+   resource "aws_s3_bucket" "my_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "hello"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-apply #714](https://github.com/dflook/terraform-github-actions/actions/runs/14040972075)